package com.txznet.marketing.bean;

public class CommandPoint {

    /*public static final int pointArr[] = { 15068, 30690,48644,74138,81172,84345,95690,118828,123931,188724 };

    public static final String commandArr[] = new String[] { "打开微信", "回复微信","导航","播放音乐","下一首" ,"来首忘情水" ,"暂停播放" ,"我要去加油站"	,"最近的那个" ,"接听电话"  };

    public static final String replyArr[] = new String[]{"您真棒","您太棒了","您很聪明欧","您很优秀欧","您太厉害了"};*/

    /**
     * 30fps
     * 00:00:36:21—00:00:37:05   打开微信
     * 00:00:55:23—00:00:56:07   回复微信
     * 00:01:08:01—00:01:08:15   导航过去
     * 00:01:42:00—00:01:42:14   放大地图
     * 00:01:44:25—00:01:45:09   缩小地图
     *
     * 00:01:47:21—00:01:48:05   黑夜模式
     * 00:01:50:05—00:01:50:19   白天模式
     * 00:01:52:22—00:01:53:06   前面怎么走
     * 00:01:57:21—00:01:58:05   查看全程
     * 00:02:05:20—00:02:06:04   播放音乐
     *
     * 00:02:11:13—00:02:11:27   下一首
     * 00:02:16:08—00:02:16:22   我要听海草舞
     * 00:02:25:11—00:02:25:25   增大音量
     * 00:02:31:10—00:02:31:24   暂停播放
     * 00:03:05:02—00:03:05:16   同行者我要去加油站
     *
     * 00:03:10:10—00:03:10:24   最近的那个
     * 00:03:53:06—00:03:53:20   你好同行者
     * 00:04:26:23—00:04:27:07   接听
     */
//    public static final int pointArr[] = { 36933, 56000,68267,102233,105067,
//            107933,110400,112967,117933,125900 ,
//            131667,136500,145600,151567,185300,
//            190567,233433,267000 };
//
//    public static final String commandArr[] = new String[] {
//            "打开微信", "回复微信","导航过去","放大地图","缩小地图" ,
//            "黑夜模式" ,"白天模式" ,"前面怎么走"	,"查看全程" ,"播放音乐" ,
//            "下一首","我要听海草舞","增大音量" ,"暂停播放" ,"同型者我要去加油站" ,
//            "最近的那个" ,"你好同型者" ,"接听"};
//
//    public static final String hintArr[] = new String[] {
//            "打开微信", "回复微信","导航过去","放大地图","缩小地图" ,
//            "黑夜模式" ,"白天模式" ,"前面怎么走"	,"查看全程" ,"播放音乐" ,
//            "下一首","我要听海草舞","增大音量" ,"暂停播放" ,"同行者我要去加油站" ,
//            "最近的那个" ,"你好同行者" ,"接听"};

    public static final int pointArr[] = { 27560,58400,61320,64280,66840,
            69480,74520,82600,88480,93400,
            102600,108680,142520,147880,190880,
            224560 };

    public static final String commandArr[] = new String[] {
            "导航","放大地图","缩小地图" ,
            "黑夜模式" ,"白天模式" ,"前面怎么走"	,"查看全程" ,"播放音乐" ,
            "下一首","我要听海草舞","增大音量" ,"暂停播放" ,"同型者我要去加油站" ,
            "最近的那个" ,"你好同型者" ,"接听"};

    public static final String hintArr[] = new String[] {
            "导航","放大地图","缩小地图" ,
            "黑夜模式" ,"白天模式" ,"前面怎么走"	,"查看全程" ,"播放音乐" ,
            "下一首","我要听海草舞","增大音量" ,"暂停播放" ,"同行者我要去加油站" ,
            "最近的那个" ,"你好同行者" ,"接听"};

    public static final String replyArr[] = new String[]{"您真棒","您太棒了","您很聪明欧","您很优秀欧","您太厉害了"};

}